import requests
import time
import os
from api import api_dns

def dnslookup():
    os.system("cls")
    dns = input("""
        ██████╗ ███╗   ██╗███████╗    ██╗      ██████╗  ██████╗ ██╗  ██╗██╗   ██╗██████╗ 
        ██╔══██╗████╗  ██║██╔════╝    ██║     ██╔═══██╗██╔═══██╗██║ ██╔╝██║   ██║██╔══██╗
        ██║  ██║██╔██╗ ██║███████╗    ██║     ██║   ██║██║   ██║█████╔╝ ██║   ██║██████╔╝
        ██║  ██║██║╚██╗██║╚════██║    ██║     ██║   ██║██║   ██║██╔═██╗ ██║   ██║██╔═══╝ 
        ██████╔╝██║ ╚████║███████║    ███████╗╚██████╔╝╚██████╔╝██║  ██╗╚██████╔╝██║     
        ╚═════╝ ╚═╝  ╚═══╝╚══════╝    ╚══════╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═╝ ╚═════╝ ╚═╝     
        Choisis l'url du site que tu veux lookup : """)
    api = f"https://api.viewdns.info/abuselookup/?domain={dns}&apikey={api_dns}&output=json"
    
    response = requests.get(api)
    data = response.json()
    try:
        if response.ok:
            print(f"Tool : {data['query']['tool']}")
            print(f"Domaine : {data['query']['domain']}")
            print(f"Abuse contact : {data['response']['abusecontact']}")
            time.sleep(2)
            print("")
            print("Tu va ètre renvoyer a l'acueil dans 2s")
            time.sleep(2)
        else:
            print(f"Error: {response.status_code}, {response.text}")
            time.sleep(2)
            print("Tu va ètre renvoyer a l'acueil dans 2s")
            time.sleep(2)
    except Exception as e:
        print(f"Error {e}")

if __name__ == "__main__":
    dnslookup()