import requests
import time
import os
from code.colors import *

def sender():
    os.system("cls")
    embed_or_no = str(input(f"""{MAGENTA}
    ██████ ██▄  ▄██ █████▄ ██████ ████▄    ▄████▄ █████▄    ███  ██ ▄████▄ 
    ██▄▄   ██ ▀▀ ██ ██▄▄██ ██▄▄   ██  ██   ██  ██ ██▄▄██▄   ██ ▀▄██ ██  ██ 
    ██▄▄▄▄ ██    ██ ██▄▄█▀ ██▄▄▄▄ ████▀    ▀████▀ ██   ██   ██   ██ ▀████▀ 
                                                                       
    Met oui pour fair un message embed et non pour un message simple (oui ou non) : """)).lower()
    os.system("cls")
    webhook = input(f"""{RED}
    ██     ██ ██████ █████▄ ██  ██ ▄████▄ ▄████▄ ██ ▄█▀   ██  ██ █████▄  ██     
    ██ ▄█▄ ██ ██▄▄   ██▄▄██ ██████ ██  ██ ██  ██ ████     ██  ██ ██▄▄██▄ ██     
     ▀██▀██▀  ██▄▄▄▄ ██▄▄█▀ ██  ██ ▀████▀ ▀████▀ ██ ▀█▄   ▀████▀ ██   ██ ██████ 
                                                                            
    Met ton url de ton webhook : """)
    os.system("cls")
    if embed_or_no == "oui":
        title = str(input(f"""{BLUE}
    ██████ ██ ██████ ██     ██████ 
      ██   ██   ██   ██     ██▄▄   
      ██   ██   ██   ██████ ██▄▄▄▄ 
                                
    Met ton title d'embed : """))
        os.system("cls")
        description = str(input(f"""{LIGHTGREEN_EX}
    ████▄  ██████ ▄█████ ▄█████ █████▄  ██ █████▄ ██████ ██ ▄████▄ ███  ██ 
    ██  ██ ██▄▄   ▀▀▀▄▄▄ ██     ██▄▄██▄ ██ ██▄▄█▀   ██   ██ ██  ██ ██ ▀▄██ 
    ████▀  ██▄▄▄▄ █████▀ ▀█████ ██   ██ ██ ██       ██   ██ ▀████▀ ██   ██ 
                                                                       
    Met la description de l'embed : """))
        os.system("cls")
        color = int(input(f"""{MAGENTA}
    ▄█████ ▄████▄ ██     ▄████▄ █████▄  
    ██     ██  ██ ██     ██  ██ ██▄▄██▄ 
    ▀█████ ▀████▀ ██████ ▀████▀ ██   ██ 
                                    
    Met ta couleur format ( 0x000000 ) : """), 16)
        os.system("cls")
        avatar_url = input(f"""{RED}
    ▄████▄ ██  ██ ▄████▄ ██████ ▄████▄ █████▄    ██  ██ █████▄  ██     
    ██▄▄██ ██▄▄██ ██▄▄██   ██   ██▄▄██ ██▄▄██▄   ██  ██ ██▄▄██▄ ██     
    ██  ██  ▀██▀  ██  ██   ██   ██  ██ ██   ██   ▀████▀ ██   ██ ██████ 
                                                                    
    Met ton avatar url ( format discord ) :    """)
        os.system("cls")
        username = input(f"""{LIGHTYELLOW_EX}
    ██  ██ ▄█████ ██████ █████▄  ███  ██ ▄████▄ ██▄  ▄██ ██████ 
    ██  ██ ▀▀▀▄▄▄ ██▄▄   ██▄▄██▄ ██ ▀▄██ ██▄▄██ ██ ▀▀ ██ ██▄▄   
    ▀████▀ █████▀ ██▄▄▄▄ ██   ██ ██   ██ ██  ██ ██    ██ ██▄▄▄▄ 
                                                            
    Met un username : """)
        
        try:
            data = {
                "username": username,
                "avatar_url": avatar_url,
                "embeds": [
                    {
                        "title": title,
                        "description": description,
                        "color": color
                    }
                ]
            }
            requests.post(webhook, json=data)
        except Exception as e:
            print(f"Error {e}")

    elif embed_or_no == "non":
        os.system("cls")
        avatar_url_no = input(f"""{GREEN}
    ▄████▄ ██  ██ ▄████▄ ██████ ▄████▄ █████▄    ██  ██ █████▄  ██     
    ██▄▄██ ██▄▄██ ██▄▄██   ██   ██▄▄██ ██▄▄██▄   ██  ██ ██▄▄██▄ ██     
    ██  ██  ▀██▀  ██  ██   ██   ██  ██ ██   ██   ▀████▀ ██   ██ ██████ 
                                                                    
    Met ton avatar url : """)
        os.system("cls")
        username_no = input(f"""{RED}
    ██  ██ ▄█████ ██████ █████▄  ███  ██ ▄████▄ ██▄  ▄██ ██████ 
    ██  ██ ▀▀▀▄▄▄ ██▄▄   ██▄▄██▄ ██ ▀▄██ ██▄▄██ ██ ▀▀ ██ ██▄▄   
    ▀████▀ █████▀ ██▄▄▄▄ ██   ██ ██   ██ ██  ██ ██    ██ ██▄▄▄▄ 
                                                            
    Met le username du webhook : """)
        os.system("cls")
        message_contenue = input(f"""
    ██▄  ▄██ ██████ ▄█████ ▄█████ ▄████▄  ▄████  ██████ 
    ██ ▀▀ ██ ██▄▄   ▀▀▀▄▄▄ ▀▀▀▄▄▄ ██▄▄██ ██  ▄▄▄ ██▄▄   
    ██    ██ ██▄▄▄▄ █████▀ █████▀ ██  ██  ▀███▀  ██▄▄▄▄ 
                                                    
    Met ton message : """)

        try:
            data = {
                "username": username_no,
                "avatar_url": avatar_url_no,
                "content": message_contenue
            }
            requests.post(webhook, json=data)
        except Exception as e:
            print(f"Error {e}")
    else:
        print(f"Choisis sois oui sois non...")

if __name__ == "__main__":
    sender()